Music_App/app/controllers/sessions_controller.rb

    def create
        @user = User.find_by_credentials(
            params[:user][:email],
            params[:user][:password]
        )
        if @user.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "tTWWAGqOOpAGFH8Kq9OBRg"], ["updated_at", "2021-02-09 18:19:44.755801"], ["id", 2]]